Repository: yachi8yo/NicoKaraMaker3Translation
Catalog: Strings/*/Resources.resw
Source language: en_us
Languages: ja_jp, ko_kr, zh_tw

# SettingsAddOnPageUnificationLayoutSelectorControl_TextBlockLayout.Text
source: Layout to use:
ja_jp: 使用するレイアウト(L)：
ko_kr: 사용할 레이아웃(L):
zh_tw: 使用的版面配置(L)：

source: Edit subtitle actions...
ja_jp: 字幕アクションの編集...
ko_kr: 자막 액션 편집...
zh_tw: 編輯字幕動作…

source: Subtitle action to use:
ja_jp: 使用する字幕アクション(U)：
ko_kr: 사용할 자막 액션(U):
zh_tw: 使用的字幕動作(U)：

# SettingsAddOnPageUtopiaControl_CheckBoxDelayInlineGraphics.Content
source: Delay the fade-out of inline graphics
ja_jp: インライングラフィックスのフェードアウトを遅らせる(D)
ko_kr: 인라인 그래픽스의 페이드 아웃 지연(D)
zh_tw: 延遲內嵌圖形的淡出(D)

source: When using inline graphics as icons for dividing lyrics into parts, enabling this option will make them easier to see.
ja_jp: インライングラフィックスを歌詞パート分けのアイコンとして使う場合、 このオプションを有効にすると見やすくなります
ko_kr: 인라인 그래픽스를 가사 파트 구분 아이콘으로 사용할 때, 이 옵션을 활성화하면 보기 편해집니다.
zh_tw: 將內嵌圖形作為區分歌詞聲部的圖示使用時， 開啟此選項會較容易看清楚

# SettingsAddOnPageUtopiaControl_TextBlockTailDelay.Text
source: Time until the last character of a line begins to disappear:
ja_jp: 行末文字が消え始めるまでの時間(T)：
ko_kr: 문장 끝 문자가 사라지기 시작할 때까지의 시간(T):
zh_tw: 句尾文字開始消失前的延遲時間(T)：

# SettingsAddOnPageViewModel_ButtonDefaultClicked_Confirm
source: We will reset all settings to their default values. Are you sure?
ja_jp: 設定をすべて初期設定に戻します。 よろしいですか？
ko_kr: 모든 설정을 초기 설정으로 되돌립니다. 계속하시겠습니까?
zh_tw: 將所有設定還原為預設值。 確定要執行嗎？

# SettingsNameModel_AdjustSettingName_New
source: New
ja_jp: 新規
ko_kr: 신규
zh_tw: 新增

# SettingsNameModel_SettingsName_Undo
source: {0} setting {1} name
ja_jp: {0}設定 {1} の名称
ko_kr: {0}설정 {1} 의 명칭
zh_tw: {0}設定 {1} 的名稱

# SettingsNameModel_SettingsNameLabel
source: {0} setting {1} name:
ja_jp: {0}設定 {1} の名称(N)：
ko_kr: {0}설정 {1} 의 명칭(N):
zh_tw: {0}設定 {1} 的名稱(N)：

# ShowTimeAdjusterPageViewModel_PageDescription
source: Automatically sets the display start and end times for all rows.
ja_jp: すべての行の表示開始時刻・表示終了時刻を自動設定します。
ko_kr: 모든 행의 표시 시작 시간과 표시 종료 시각을 자동으로 설정합니다.
zh_tw: 自動設定所有行的顯示開始時間與顯示結束時間。

# ShowTimeAdjusterPageViewModel_Title
source: Automatically set the display start and end time
ja_jp: 自動で表示開始時刻・表示終了時刻を設定
ko_kr: 자동으로 표시 시작 시간·표시 종료 시각 설정
zh_tw: 自動設定顯示開始與結束時間

# SlideUpDown_Description
source: Slide the entire row up or down
ja_jp: 行全体を上または下にスライド移動
ko_kr: 전체 행을 위 또는 아래로 슬라이드 이동
zh_tw: 將整行向上或向下滑動

# SlideUpDown_Name
source: Up and down slide
ja_jp: 上下スライド
ko_kr: 상하 슬라이드
zh_tw: 上下滑動

# SourceInfoModel_BackgroundColor_Undo
source: Background color
ja_jp: 背景色
ko_kr: 배경색
zh_tw: 背景色

# SourceInfoModel_BackgroundHeight_Undo
source: Resolution (vertical)
ja_jp: 解像度（縦）
ko_kr: 해상도(세로)
zh_tw: 解析度 (垂直)

# SourceInfoModel_BackgroundWidth_Undo
source: Resolution (horizontal)
ja_jp: 解像度（横）
ko_kr: 해상도(가로)
zh_tw: 解析度 (水平)

# SourceInfoModel_Fps_Undo
source: Frame rate
ja_jp: フレームレート
ko_kr: 프레임 레이트
zh_tw: 影格率

# SourceInfoModel_ImagePath_Undo
source: Image file name
ja_jp: 画像ファイル名
ko_kr: 이미지 파일 이름
zh_tw: 圖片檔名

# SourceInfoModel_MoviePath_Undo
source: Original song video file name
ja_jp: 元になる曲の動画ファイル名
ko_kr: 원곡 동영상 파일 이름
zh_tw: 作為原曲的影片檔名

# SourceInfoModel_MoviePlusSound_Undo
source: Use audio from a separate file
ja_jp: 別ファイルの音声を使用する
ko_kr: 다른 파일의 음성을 사용
zh_tw: 使用其他檔案的音訊

# SourceInfoModel_SoundTrackList_Undo
source: Audio files
ja_jp: 音声ファイル群
ko_kr: 음성 파일 모음
zh_tw: 音訊檔

# SourceInfoModel_SourceKind_Undo
source: Types of background materials
ja_jp: 背景素材の種類
ko_kr: 배경 소재의 종류
zh_tw: 背景素材類型

# SpinFlip_Description
source: Each letter spins and flips
ja_jp: 文字ごとにスピンしながらフリップする
ko_kr: 각 문자마다 스핀하며 플립하기
zh_tw: 每個字元會同時旋轉與翻轉

# SpinFlip_Name
source: Spin flip
ja_jp: スピンフリップ
ko_kr: 스핀 플립
zh_tw: 旋轉翻轉 (Spin Flip)

# SplashPage_TextBlockAppName.Text
source: Nicokara Karaoke Video Maker 3
ja_jp: ニコカラメーカー 3
ko_kr: 니코카라 메이커 3
zh_tw: NicoKaraMaker 3

# SplashPage_TextBlockStarting.Text
source: Starting up...
ja_jp: 起動しています...
ko_kr: 시작하는 중...
zh_tw: 正在啟動…

# SubtitleActionSelectorPageViewModel_PageDescription
source: Automatically sets the action for all rows.
ja_jp: すべての行のアクションを自動設定します。
ko_kr: 모든 행의 작업을 자동으로 설정합니다.
zh_tw: 自動設定所有行的動作。

# SubtitleActionSelectorPageViewModel_Title
source: Automatically set actions
ja_jp: 自動でアクションを設定
ko_kr: 자동으로 액션을 설정
zh_tw: 自動設定動作

# TitleInfoControl_ButtonEditShowTime.ToolTipService.ToolTip
source: Edit display time...
ja_jp: 表示時刻の編集(S)...
ko_kr: 표시 시간 편집(S)...
zh_tw: 編輯顯示時間(S)…

# TitleInfoControl_TableViewColumnFont.Header
source: Font
ja_jp: フォント
ko_kr: 글꼴
zh_tw: 字型

# TitleInfoControl_TableViewColumnSubtitleAction.Header
source: Actions
ja_jp: アクション
ko_kr: 액션
zh_tw: 動作

# TitleInfoControl_TableViewColumnTitle.Header
source: Title
ja_jp: タイトル
ko_kr: 제목
zh_tw: 標題

# TitleInfoControl_TextBlockLayout.Text
source: Layout:
ja_jp: レイアウト(L)：
ko_kr: 레이아웃(L):
zh_tw: 版面配置(L)：

# TitleInfoControl_TextBlockShowTime.Text
source: Display time:
ja_jp: 表示時刻(S)：
ko_kr: 표시 시각(S):
zh_tw: 顯示時間(S)：

# TitleInfoModel_ModelName
source: Title
ja_jp: タイトル
ko_kr: 제목
zh_tw: 標題

# ToastHistoryPage_TextBlockDescription.Text
source: This displays the history, including cases where notifications are turned off in the settings or OS settings.
ja_jp: 環境設定や OS の設定で通知がオフになっている場合の履歴も含めて表示しています。
ko_kr: 환경 설정이나 OS 설정에서 알림이 꺼져 있는 경우의 기록도 포함하여 표시하고 있습니다.
zh_tw: 包含因偏好設定或 OS 設定而關閉通知的歷史記錄也會顯示於此。

# ToastHistoryWindow_Title
source: Notification history
ja_jp: 通知履歴
ko_kr: 알림 기록
zh_tw: 通知記錄

# TopLongAdjuster_Description
source: To make the connection with the lyrics in the lower section clearer, the lyrics in the upper section are displayed for as long as possible. The timing of the middle section will change depending on the vertical arrangement of the layout. This is the same standard setting method as the display time in the original Nicokara Karaoke Video Maker.
ja_jp: 下段の歌詞とのつながりがわかりやすいよう、上段の歌詞をなるべく長めに表示します。 中段のタイミングは、レイアウトの上下配置により変わります。 初代ニコカラメーカーの表示時刻と同じ、標準的な設定方法です。
ko_kr: 아랫부분 가사와의 연결을 쉽게 알 수 있도록, 윗부분의 가사를 최대한 길게 표시합니다. 중간의 타이밍은 레이아웃의 상하 배치에 따라 달라집니다. 초대 니코카라 메이커의 표시 시간과 동일한, 표준적인 설정 방법입니다.
zh_tw: 為了讓與下行歌詞的銜接更自然，上行歌詞會盡量顯示久一點。 中段的時間點將隨版面配置的垂直位置而改變。 這是與初代 NicoKaraMaker 的顯示時間相同的標準設定方式。

# TopLongAdjuster_Name
source: Display the lyrics in the upper section in a longer format
ja_jp: 上段歌詞を長めに表示する
ko_kr: 윗부분 가사를 길게 표시한다
zh_tw: 較長時間顯示上行歌詞

# TopShortAdjuster_Description
source: To avoid interfering with the background video, the lyrics at the top will be wiped away and then quickly removed.
ja_jp: 背景動画の邪魔をしないよう、上段の歌詞をワイプ後速やかに消します。
ko_kr: 배경 동영상을 방해하지 않도록, 윗부분 가사를 와이프 후 신속하게 지웁니다.
zh_tw: 為了不干擾背景影片，上行歌詞會在刷色後儘快消失。

# TopShortAdjuster_Name
source: Quickly erase the lyrics in the upper section
ja_jp: 上段歌詞を速やかに消す
ko_kr: 윗부분 가사를 신속하게 지웁니다
zh_tw: 讓上行歌詞儘快消失

# UndoManager_UpdateCanUndoAndRedo_Error_CannotRedo
source: Redo
ja_jp: やり直しできません
ko_kr: 다시 할 수 없습니다
zh_tw: 無法重做

# UndoManager_UpdateCanUndoAndRedo_Error_CannotUndo
source: Undo
ja_jp: 元に戻せません
ko_kr: 되돌릴 수 없습니다
zh_tw: 無法復原

# UndoManager_UpdateCanUndoAndRedo_Information_Redo
source: Redo - {0}
ja_jp: やり直し(R) - {0}
ko_kr: 다시 하기(R) - {0}
zh_tw: 重做(R) - {0}

# UndoManager_UpdateCanUndoAndRedo_Information_Undo
source: Undo - {0}
ja_jp: 元に戻す(U) - {0}
ko_kr: 되돌리기(U) - {0}
zh_tw: 復原(U) - {0}

# UnificationFontSelector_Description
source: Unify everything to the same font.
ja_jp: すべて同じフォントに統一します。
ko_kr: 모두 동일한 글꼴로 통일합니다.
zh_tw: 全部統一為相同的字型。

# UnificationFontSelector_Name
source: Use the same font for everything
ja_jp: すべて同じフォントにする
ko_kr: 모두 동일한 글꼴로 설정
zh_tw: 全部設定為相同的字型

# UnificationLayoutSelector_Description
source: Unify everything to the same layout.
ja_jp: すべて同じレイアウトに統一します。
ko_kr: 모두 동일한 레이아웃로 통일합니다.
zh_tw: 全部統一為相同的版面配置。

# UnificationLayoutSelector_Name
source: Use the same layout for everything
ja_jp: すべて同じレイアウトにする
ko_kr: 모두 동일한 레이아웃로 설정
zh_tw: 全部設定為相同的版面配置

# UnificationSubtitleActionSelector_Description
source: Unify everything to the same action.
ja_jp: すべて同じ字幕アクションに統一します。
ko_kr: 모두 동일한 자막 액션로 통일합니다.
zh_tw: 全部統一為相同的字幕動作。

# UnificationSubtitleActionSelector_Name
source: Unify everything to the same action
ja_jp: すべて同じ字幕アクションにする
ko_kr: 모두 동일한 자막 액션로 설정
zh_tw: 全部設定為相同的字幕動作

# Utopia_Description
source: The text after the wipe fades away, twisting as it goes
ja_jp: ワイプ後の文字がひねりながら消えていく
ko_kr: 아내의 문자가 비틀리며 사라져 간다
zh_tw: 刷色後的文字一邊扭轉一邊消失

# Utopia_Name
source: Utopia
ja_jp: ユートピア
ko_kr: 유토피아
zh_tw: 烏托邦 (Utopia)

source: Warning
ja_jp: 警告
ko_kr: 경고
zh_tw: 警告

# WarningsPage_ToggleButtonInformations.ToolTipService.ToolTip
source: Show information
ja_jp: 情報を表示(I)
ko_kr: 정보 표시(I)
zh_tw: 顯示資訊(I)

# WarningsPage_ToggleButtonWarnings.ToolTipService.ToolTip
source: Show warning
ja_jp: 警告を表示(W)
ko_kr: 경고 표시(W)
zh_tw: 顯示警告(W)

# WarningsWindow_Title
source: List of warnings and information
ja_jp: 警告・情報一覧
ko_kr: 경고·정보 목록
zh_tw: 警告與資訊清單

source: Yes
ja_jp: はい
ko_kr: 예
zh_tw: 是
